app/Controllers/carrito_controller.php

SELECT *
FROM `talles`
WHERE `id_talle` = '1'
 LIMIT 1
SELECT *
FROM `colores`
WHERE `id_colores` = '9'
 LIMIT 1
SELECT *
FROM `productos`
WHERE `id_producto` = '91'
 LIMIT 1
---
    public function agregar_al_carrito(){

        $session = session();
        $usuarioID = session()->get('id_usuario');

        $idProducto = $this->request->getPost('id_producto');
        $cantidad =  $this->request->getPost('cantidad');
        $talle =   $this->request->getPost('talle');
        $color =  $this->request->getPost('color');

        $productoDetalle = new productos_detalle_Model();
        $productos = new producto_Model();
        $tallesModel = new talles_Model();
        $coloresModel = new colores_Model();

        $productoDetalleAgregado = $productoDetalle->buscarDetalleProducto($idProducto, $talle, $color);
        $idTalle = $tallesModel->where('id_talle', $talle)->first();
        $idColor = $coloresModel->where('id_colores', $color)->first();

        $idProductoAgregado = $productos->where('id_producto', $idProducto)->first();