app/Controllers/color_controller.php

SELECT *
FROM `colores`
---
    public function index(){
        $colorModel = new colores_Model();
        $colores['colores'] = $colorModel->findAll();