app/Controllers/contacto_controller.php

    public function index(){
        $contactoModel = new contacto_Model();
        $data['contactos'] = $contactoModel->findAll();
---
SELECT *
FROM `contactos`