app/Controllers/producto_controller.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `talles`
WHERE `estado` = 1
---
    public function altaProducto() {

        $categoriaModel = new categoria_Model();
        $categorias = $categoriaModel->where('activo', 1)->findAll();

        $talleModel = new talles_Model();
        $talles = $talleModel->where('estado', 1)->findAll();

SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `talles`
WHERE `estado` = 1
---
    public function create(){

        $reglas = $this->validate($this->obtenerReglas());

        if(!$reglas){
        $categoriaModel = new categoria_Model();
        $categorias = $categoriaModel->where('activo', 1)->findAll();

        $talleModel = new talles_Model();
        $talles = $talleModel->where('estado', 1)->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '75'
---
public function delete($id){
        $productoModel = new producto_Model();
        $producto = $productoModel->where('id_producto', $id)->first();

SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `talles`
WHERE `estado` = 1
---
public function edit($id){

        $productoModel = new producto_Model();
        $categoriaModel = new categoria_Model();
        $productoDetalleModel = new productos_detalle_Model();

        $categorias = $categoriaModel->where('activo', 1)->findAll();
        $producto = $productoModel->find($id);

        $talleModel = new talles_Model();
        $talles = $talleModel->where('estado', 1)->findAll();

SELECT *
FROM `productos`
WHERE `estado` = 1
ORDER BY `id_producto` DESC
SELECT *
FROM `categoria`
WHERE `activo` = 1
SELECT *
FROM `talles`
WHERE `estado` = 1
---
    public function productos()
    {
        $productoModel = new producto_Model();
        $productos = $productoModel->where('estado', 1)->orderBy('id_producto', 'DESC')->findAll();

        $categoriaModel = new categoria_Model();
        $categorias = $categoriaModel->where('activo', 1)->findAll();

        $talleModel = new talles_Model();
        $talles = $talleModel->where('estado', 1)->findAll();

SELECT *
FROM `productos`
WHERE `estado` = 1
AND `categoria_id` = '9'
ORDER BY `id_producto` DESC
SELECT *
FROM `categoria`
WHERE `activo` = 1
SELECT *
FROM `talles`
WHERE `estado` = 1
---
    public function ProductosPorCategoria($idCategoria){
        $productoModel = new producto_Model();
        $productos = $productoModel->where('estado', 1)
                                    ->where('categoria_id', $idCategoria)
                                    ->orderBy('id_producto', 'DESC')->findAll();

        $categoriaModel = new categoria_Model();
        $categorias = $categoriaModel->where('activo', 1)->findAll();

        $talleModel = new talles_Model();
        $talles = $talleModel->where('estado', 1)->findAll();