app/Controllers/ventas_controller.php

                session()->setFlashdata('error', 'No se pudo realizar su compra.');
                return view('cliente/carrito', ['carrito' => $carrito]);
            }
            $this->productos->update($producto['producto_id'], ['stock' => $stock]);
---
UPDATE `productos` SET `stock` = 31
WHERE `productos`.`id_producto` IN ('93')

                        session()->setFlashdata('error', 'No se pudo realizar su compra.');
                        return view('cliente/carrito', ['carrito' => $carrito]);
                    }
                    $this->productosDetalle->update($producto['id_detalle_producto'], ['stock' => $stockDetalle]);
---
UPDATE `productos_detalle` SET `stock` = 2
WHERE `productos_detalle`.`id_producto` IN ('69')