app/Models/producto_Model.php

    public function topProductosVendidos()
    {
        return $this->select('productos.*, SUM(ventas_detalle.cantidad) as total_vendido, SUM(productos_detalle.stock) AS stock_total')
                    ->join('productos_detalle', 'productos.id_producto = productos_detalle.producto_id')
                    ->join('ventas_detalle', 'productos_detalle.id_producto = ventas_detalle.producto_detalle_id')
                    ->orderBy('total_vendido', 'DESC')
                    ->where('productos.estado', 1)
                    ->groupBy('productos.id_producto')
                    ->having('stock_total >', 0)
                    ->findAll(12);
---
SELECT `productos`.*, SUM(ventas_detalle.cantidad) as total_vendido
FROM `productos`
JOIN `productos_detalle` ON `productos`.`id_producto` = `productos_detalle`.`producto_id`
JOIN `ventas_detalle` ON `productos_detalle`.`id_producto` = `ventas_detalle`.`producto_detalle_id`
WHERE `productos`.`categoria_id` = '3'
AND `productos`.`estado` = 1
AND `productos`.`id_producto` != '75'
GROUP BY `productos`.`id_producto`
ORDER BY `total_vendido` DESC
 LIMIT 4

    public function topProductosVendidosPorCategoria($categoriaID, $IDproducto)
    {
        return $this->select('productos.*, SUM(ventas_detalle.cantidad) as total_vendido, SUM(productos_detalle.stock) AS stock_total')
                    ->join('productos_detalle', 'productos.id_producto = productos_detalle.producto_id')
                    ->join('ventas_detalle', 'productos_detalle.id_producto = ventas_detalle.producto_detalle_id')
                    ->orderBy('total_vendido', 'DESC')
                    ->where('productos.categoria_id', $categoriaID)
                    ->where('productos.estado', 1)
                    ->where('productos.id_producto !=', $IDproducto)
                    ->groupBy('productos.id_producto')
                    ->findAll(4);
---
SELECT `productos`.*, SUM(ventas_detalle.cantidad) as total_vendido
FROM `productos`
JOIN `ventas_detalle` ON `productos`.`id_producto` = `ventas_detalle`.`producto_id`
WHERE `productos`.`categoria_id` = '11'
AND `productos`.`estado` = 1
AND `productos`.`id_producto` != '90'
GROUP BY `productos`.`id_producto`
ORDER BY `total_vendido` DESC