app/Models/productos_detalle_Model.php

public function primerDetalleProducto($idProducto){
        return $this->select('productos_detalle.talle_id, productos_detalle.color_id , talles.talle, colores.nombre, colores.codigo_hex')
                ->join('talles', 'talles.id_talle = productos_detalle.talle_id')
                ->join('colores', 'colores.id_colores = productos_detalle.color_id')
                ->where('productos_detalle.producto_id', $idProducto)
                ->first();
---
SELECT `productos_detalle`.`talle_id`, `productos_detalle`.`color_id`, `talles`.`talle`, `colores`.`nombre`, `colores`.`codigo_hex`
FROM `productos_detalle`
JOIN `talles` ON `talles`.`id_talle` = `productos_detalle`.`talle_id`
JOIN `colores` ON `colores`.`id_colores` = `productos_detalle`.`color_id`
WHERE `productos_detalle`.`producto_id` = '90'
 LIMIT 1

public function obtenerDetallesCarrito(array $idsDetalle): array
{
    if (empty($idsDetalle)) {
        return [];
    }

    return $this->select('
            productos_detalle.id_producto,
            productos_detalle.producto_id,
            productos_detalle.talle_id,
            productos_detalle.color_id,
            productos_detalle.stock,

            productos.nombre_producto,
            productos.precio,
            productos.imagen,

            talles.talle,
            colores.nombre AS color
        ')
        ->join('productos', 'productos.id_producto = productos_detalle.producto_id')
        ->join('talles', 'talles.id_talle = productos_detalle.talle_id', 'left')
        ->join('colores', 'colores.id_colores = productos_detalle.color_id', 'left')
        ->whereIn('productos_detalle.id_producto', $idsDetalle)
        ->findAll();
---
SELECT `productos_detalle`.`id_producto`, `productos_detalle`.`producto_id`, `productos_detalle`.`talle_id`, `productos_detalle`.`color_id`, `productos_detalle`.`stock`, `productos`.`nombre_producto`, `productos`.`precio`, `productos`.`imagen`, `talles`.`talle`, `colores`.`nombre` AS `color`
FROM `productos_detalle`
JOIN `productos` ON `productos`.`id_producto` = `productos_detalle`.`producto_id`
LEFT JOIN `talles` ON `talles`.`id_talle` = `productos_detalle`.`talle_id`
LEFT JOIN `colores` ON `colores`.`id_colores` = `productos_detalle`.`color_id`
WHERE `productos_detalle`.`id_producto` IN (44)