app/Models/usuario_Model.php

public function actualizarCarrito($idUsuario, $carrito)
    {
        $this->update($idUsuario, ['carrito' => json_encode($carrito)]);
---
UPDATE `usuarios` SET `carrito` = '[]'
WHERE `usuarios`.`id_usuario` IN ('19')

public function obtenerCarrito($idUsuario)
    {
        $usuario = $this->find($idUsuario);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '19'