app/Models/ventas_detalle_Model.php

public function listarVentasDetalle($idVenta){
        return $this->select('ventas_detalle.*, productos.nombre_producto, talles.talle, colores.nombre as color')
                ->join('productos_detalle', 'productos_detalle.id_producto = ventas_detalle.producto_detalle_id')
                ->join('productos', 'productos.id_producto = productos_detalle.producto_id')
                ->join('colores', 'colores.id_colores = productos_detalle.color_id')
                ->join('talles', 'talles.id_talle = productos_detalle.talle_id')
                ->where('ventas_detalle.venta_id', $idVenta)
                ->findAll();
---
SELECT `ventas_detalle`.*, `productos`.`nombre_producto`
FROM `ventas_detalle`
JOIN `productos_detalle` ON `productos_detalle`.`id_producto` = `ventas_detalle`.`producto_detalle_id`
JOIN `productos` ON `productos`.`id_producto` = `productos_detalle`.`producto_id`
WHERE `ventas_detalle`.`venta_id` = '80'