app/Models/ventas_cabecera_Model.php

public function listarVentas(){
        return $this->select('ventas_cabecera.*, usuarios.nombre')
                ->join('usuarios', 'usuarios.id_usuario = ventas_cabecera.usuario_id')
                ->findAll();
---
SELECT `ventas_cabecera`.*, `usuarios`.`nombre`
FROM `ventas_cabecera`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas_cabecera`.`usuario_id`